# Rename Multiple Pandas Dataframe Column Names At Once
### Preliminaries

In [4]:
# Import modules
import pandas as pd

# Set ipython's max row display
pd.set_option('display.max_rows', 1000)

# Set ipython's max column width to 50
pd.set_option('display.max_columns', 50)

## Create an example dataframe

In [5]:
# Create an example dataframe
data = {'Commander': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'Date': ['2012, 02, 08', '2012, 02, 08', '2012, 02, 08', '2012, 02, 08', '2012, 02, 08'], 
        'Score': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

           Commander          Date  Score
Cochice        Jason  2012, 02, 08      4
Pima           Molly  2012, 02, 08     24
Santa Cruz      Tina  2012, 02, 08     31
Maricopa        Jake  2012, 02, 08      2
Yuma             Amy  2012, 02, 08      3

### Rename Column Names

In [9]:
df.columns = ['Leader', 'Time','Score']
df

           Leader          Time  Score
Cochice     Jason  2012, 02, 08      4
Pima        Molly  2012, 02, 08     24
Santa Cruz   Tina  2012, 02, 08     31
Maricopa     Jake  2012, 02, 08      2
Yuma          Amy  2012, 02, 08      3

In [12]:
df.rename(columns={'Leader':'Commander'}, inplace=True)
df

           Commander          Time  Score
Cochice        Jason  2012, 02, 08      4
Pima           Molly  2012, 02, 08     24
Santa Cruz      Tina  2012, 02, 08     31
Maricopa        Jake  2012, 02, 08      2
Yuma             Amy  2012, 02, 08      3

Source: https://chrisalbon.com/python/pandas_rename_multiple_columns.html